## Simple SQL tutorial

In [1]:
%load_ext sql
%sql sqlite://

'Connected: @None'

In [2]:
%%sql

CREATE TABLE person(
    person_id INTEGER NOT NULL,
    person_first_name VARCHAR(55) NOT NULL,
    person_last_name VARCHAR(55) NULL,
    person_contacted_ntimes INTEGER NOT NULL, 
    person_address VARCHAR(55) NULL, 
    person_date_added DATETIME NOT NULL
);

INSERT INTO person 
    VALUES  (1, 'Jon', 'Flanders', 5, 'London', '2022-03-19 13:47:25'),
            (2, 'Shannon', 'Ahern', 0, 'Glasgow', '2022-04-23 13:47:25'),
            (3, 'Fritz', 'Onion', 1, 'York', '2022-04-25 13:47:25'),
            (4, 'Jon', 'Brown', 3, 'Cambridge', '2022-05-11 13:47:25'),
            (5, 'Fritz', 'Owen', 2, 'Edinburgh', '2022-06-01 13:47:25'),
            (6, 'Mary', 'Ahern', 8, NULL, '2022-06-01 13:47:25');

 * sqlite://
Done.
6 rows affected.

[]

In [3]:
%%sql

CREATE TABLE email_address(	
    email_address_id INTEGER NOT NULL,	
    email_address_person_id INTEGER,	
    email_address VARCHAR(55) NULL, 
    CONSTRAINT PK_email_address PRIMARY KEY (email_address_id )
);

INSERT INTO email_address 
    VALUES  (1, 1, 'jon.flanders@xyz.com'),
            (2, 1, 'jonf@abc.com'),
            (3, 2, 'shannonah@abc.co'),
            (4, 3, 'onionfritz@zyk.com'),
            (5, 3, 'mrofritz@abc.net'),
            (6, 4, 'jbrown@hkc.org'),
            (7, 6, 'marya@mail.com'),
            (8, 6, 'msahern@mail.com'),
            (9, 6, 'ahern.m@hij.co');

 * sqlite://
Done.
9 rows affected.

[]

In [4]:
%%sql
SELECT * FROM person;

 * sqlite://
Done.

[(1, 'Jon', 'Flanders', 5, 'London', '2022-03-19 13:47:25'),
 (2, 'Shannon', 'Ahern', 0, 'Glasgow', '2022-04-23 13:47:25'),
 (3, 'Fritz', 'Onion', 1, 'York', '2022-04-25 13:47:25'),
 (4, 'Jon', 'Brown', 3, 'Cambridge', '2022-05-11 13:47:25'),
 (5, 'Fritz', 'Owen', 2, 'Edinburgh', '2022-06-01 13:47:25'),
 (6, 'Mary', 'Ahern', 8, None, '2022-06-01 13:47:25')]

In [5]:
%%sql
SELECT * FROM email_address;

 * sqlite://
Done.

[(1, 1, 'jon.flanders@xyz.com'),
 (2, 1, 'jonf@abc.com'),
 (3, 2, 'shannonah@abc.co'),
 (4, 3, 'onionfritz@zyk.com'),
 (5, 3, 'mrofritz@abc.net'),
 (6, 4, 'jbrown@hkc.org'),
 (7, 6, 'marya@mail.com'),
 (8, 6, 'msahern@mail.com'),
 (9, 6, 'ahern.m@hij.co')]

In [6]:
%%sql
SELECT p.person_first_name as FirstName, p.person_last_name as LastName
FROM person p

 * sqlite://
Done.

[('Jon', 'Flanders'),
 ('Shannon', 'Ahern'),
 ('Fritz', 'Onion'),
 ('Jon', 'Brown'),
 ('Fritz', 'Owen'),
 ('Mary', 'Ahern')]

## WHERE
* AND, OR, BETWEEN, LIKE, IN, IS, IS NOT

In [7]:
%%sql
SELECT p.person_first_name as FirstName, p.person_last_name as LastName
FROM person p
WHERE p.person_first_name='Jon' AND p.person_contacted_ntimes > 4;

 * sqlite://
Done.

[('Jon', 'Flanders')]

In [8]:
%%sql
SELECT p.person_first_name, p.person_last_name
FROM person p
WHERE p.person_first_name='Jon' OR p.person_last_name='Flanders';

 * sqlite://
Done.

[('Jon', 'Flanders'), ('Jon', 'Brown')]

In [9]:
%%sql
SELECT p.person_first_name as FirstName, p.person_last_name as LastName, p.person_contacted_ntimes
FROM person p
WHERE p.person_contacted_ntimes BETWEEN 1 AND 4;

 * sqlite://
Done.

[('Fritz', 'Onion', 1), ('Jon', 'Brown', 3), ('Fritz', 'Owen', 2)]

% is a wildcard character that represents zero or more characters.

In [10]:
%%sql
SELECT p.person_first_name as FirstName, p.person_last_name as LastName
FROM person p
WHERE p.person_first_name LIKE 'J%';

 * sqlite://
Done.

[('Jon', 'Flanders'), ('Jon', 'Brown')]

In [11]:
%%sql
SELECT p.person_first_name as FirstName, p.person_last_name as LastName
FROM person p
WHERE p.person_first_name IN ('Jon', 'Fritz');

 * sqlite://
Done.

[('Jon', 'Flanders'), ('Fritz', 'Onion'), ('Jon', 'Brown'), ('Fritz', 'Owen')]

In [12]:
%%sql
SELECT p.person_first_name as FirstName, p.person_last_name as LastName, p.person_address as Address
FROM person p
WHERE p.person_address IS NULL;

 * sqlite://
Done.

[('Mary', 'Ahern', None)]

In [13]:
%%sql
SELECT p.person_first_name as FirstName, p.person_last_name as LastName
FROM person p
WHERE p.person_last_name IS NOT NULL;

 * sqlite://
Done.

[('Jon', 'Flanders'),
 ('Shannon', 'Ahern'),
 ('Fritz', 'Onion'),
 ('Jon', 'Brown'),
 ('Fritz', 'Owen'),
 ('Mary', 'Ahern')]

## ORDER BY
* After the WHERE clause (if any)
* Can specify one or more columns
* ASC (default) or DESC

In [14]:
%%sql
SELECT p.person_first_name as FirstName, p.person_last_name as LastName
FROM person p
ORDER BY p.person_last_name;

 * sqlite://
Done.

[('Shannon', 'Ahern'),
 ('Mary', 'Ahern'),
 ('Jon', 'Brown'),
 ('Jon', 'Flanders'),
 ('Fritz', 'Onion'),
 ('Fritz', 'Owen')]

## Set functions + Qualifiers
* set functions and qualifiers are often used together.
* add the qualifier inside the function.

In [15]:
%%sql
SELECT COUNT(p.person_first_name)
FROM person p;

 * sqlite://
Done.

[(6,)]

In [16]:
%%sql
SELECT COUNT(DISTINCT p.person_first_name)
FROM person p;

 * sqlite://
Done.

[(4,)]

## GROUP BY
* Breaks result set into subsets
* Subset is created by column in GROUP BY
* The column must appear in the SELECT

In [17]:
%%sql
SELECT COUNT(p.person_first_name), p.person_first_name
FROM person p
GROUP BY p.person_first_name;

 * sqlite://
Done.

[(2, 'Fritz'), (2, 'Jon'), (1, 'Mary'), (1, 'Shannon')]

## HAVING
* It works like WHERE works against SELECT in a query with a GROUP BY clause.

In [18]:
%%sql
SELECT COUNT(p.person_first_name), p.person_first_name
FROM person p
GROUP BY p.person_first_name
HAVING COUNT(p.person_first_name) >= 2;

 * sqlite://
Done.

[(2, 'Fritz'), (2, 'Jon')]

Using aliasing to obtain the same results as above:

In [19]:
%%sql
SELECT COUNT(p.person_first_name) as FirstNameCount, p.person_first_name
FROM person p
GROUP BY p.person_first_name
HAVING FirstNameCount >= 2;

 * sqlite://
Done.

[(2, 'Fritz'), (2, 'Jon')]

In [20]:
%%sql
SELECT COUNT(p.person_first_name), p.person_first_name
FROM person p
GROUP BY p.person_first_name
HAVING p.person_first_name='Jon';

 * sqlite://
Done.

[(2, 'Jon')]

## JOIN

### CROSS JOIN
* Simplest JOIN
* Inefficient
* Least useful
* No WHERE clause


Don't do the below, FROM clause with multiple tables and no WHERE clause.

In [21]:
%%sql
SELECT p.person_first_name, p.person_last_name, e.email_address
FROM person p, email_address e

 * sqlite://
Done.

[('Jon', 'Flanders', 'jon.flanders@xyz.com'),
 ('Jon', 'Flanders', 'jonf@abc.com'),
 ('Jon', 'Flanders', 'shannonah@abc.co'),
 ('Jon', 'Flanders', 'onionfritz@zyk.com'),
 ('Jon', 'Flanders', 'mrofritz@abc.net'),
 ('Jon', 'Flanders', 'jbrown@hkc.org'),
 ('Jon', 'Flanders', 'marya@mail.com'),
 ('Jon', 'Flanders', 'msahern@mail.com'),
 ('Jon', 'Flanders', 'ahern.m@hij.co'),
 ('Shannon', 'Ahern', 'jon.flanders@xyz.com'),
 ('Shannon', 'Ahern', 'jonf@abc.com'),
 ('Shannon', 'Ahern', 'shannonah@abc.co'),
 ('Shannon', 'Ahern', 'onionfritz@zyk.com'),
 ('Shannon', 'Ahern', 'mrofritz@abc.net'),
 ('Shannon', 'Ahern', 'jbrown@hkc.org'),
 ('Shannon', 'Ahern', 'marya@mail.com'),
 ('Shannon', 'Ahern', 'msahern@mail.com'),
 ('Shannon', 'Ahern', 'ahern.m@hij.co'),
 ('Fritz', 'Onion', 'jon.flanders@xyz.com'),
 ('Fritz', 'Onion', 'jonf@abc.com'),
 ('Fritz', 'Onion', 'shannonah@abc.co'),
 ('Fritz', 'Onion', 'onionfritz@zyk.com'),
 ('Fritz', 'Onion', 'mrofritz@abc.net'),
 ('Fritz', 'Onion', 'jbrown@hkc.org'),
 ('Fritz', 'Onion', 'marya@mail.com'),
 ('Fritz', 'Onion', 'msahern@mail.com'),
 ('Fritz', 'Onion', 'ahern.m@hij.co'),
 ('Jon', 'Brown', 'jon.flanders@xyz.com'),
 ('Jon', 'Brown', 'jonf@abc.com'),
 ('Jon', 'Brown', 'shannonah@abc.co'),
 ('Jon', 'Brown', 'onionfritz@zyk.com'),
 ('Jon', 'Brown', 'mrofritz@abc.net'),
 ('Jon', 'Brown', 'jbrown@hkc.org'),
 ('Jon', 'Brown', 'marya@mail.com'),
 ('Jon', 'Brown', 'msahern@mail.com'),
 ('Jon', 'Brown', 'ahern.m@hij.co'),
 ('Fritz', 'Owen', 'jon.flanders@xyz.com'),
 ('Fritz', 'Owen', 'jonf@abc.com'),
 ('Fritz', 'Owen', 'shannonah@abc.co'),
 ('Fritz', 'Owen', 'onionfritz@zyk.com'),
 ('Fritz', 'Owen', 'mrofritz@abc.net'),
 ('Fritz', 'Owen', 'jbrown@hkc.org'),
 ('Fritz', 'Owen', 'marya@mail.com'),
 ('Fritz', 'Owen', 'msahern@mail.com'),
 ('Fritz', 'Owen', 'ahern.m@hij.co'),
 ('Mary', 'Ahern', 'jon.flanders@xyz.com'),
 ('Mary', 'Ahern', 'jonf@abc.com'),
 ('Mary', 'Ahern', 'shannonah@abc.co'),
 ('Mary', 'Ahern', 'onionfritz@zyk.com'),
 ('Mary', 'Ahern', 'mrofritz@abc.net'),
 ('Mary', 'Ahern', 'jbrown@hkc.org'),
 ('Mary', 'Ahern', 'marya@mail.com'),
 ('Mary', 'Ahern', 'msahern@mail.com'),
 ('Mary', 'Ahern', 'ahern.m@hij.co')]

### INNER JOIN
* Matches column in one of the tables to column in another table.

In [22]:
%%sql
SELECT p.person_first_name, p.person_last_name, e.email_address
FROM person p
INNER JOIN email_address e
ON p.person_id = e.email_address_person_id;

 * sqlite://
Done.

[('Jon', 'Flanders', 'jon.flanders@xyz.com'),
 ('Jon', 'Flanders', 'jonf@abc.com'),
 ('Shannon', 'Ahern', 'shannonah@abc.co'),
 ('Fritz', 'Onion', 'mrofritz@abc.net'),
 ('Fritz', 'Onion', 'onionfritz@zyk.com'),
 ('Jon', 'Brown', 'jbrown@hkc.org'),
 ('Mary', 'Ahern', 'ahern.m@hij.co'),
 ('Mary', 'Ahern', 'marya@mail.com'),
 ('Mary', 'Ahern', 'msahern@mail.com')]

### OUTER JOIN
* INNER JOIN does not deal with NULL values
* OUTER JOIN works even when there's no match in the second table.

#### LEFT OUTER JOIN
* All rows from the left side will be returned.
* NULL for non-matching right side table.

In [23]:
%%sql
SELECT p.person_first_name, p.person_last_name, e.email_address
FROM person p
LEFT OUTER JOIN email_address e
ON p.person_id = e.email_address_person_id;

 * sqlite://
Done.

[('Jon', 'Flanders', 'jon.flanders@xyz.com'),
 ('Jon', 'Flanders', 'jonf@abc.com'),
 ('Shannon', 'Ahern', 'shannonah@abc.co'),
 ('Fritz', 'Onion', 'mrofritz@abc.net'),
 ('Fritz', 'Onion', 'onionfritz@zyk.com'),
 ('Jon', 'Brown', 'jbrown@hkc.org'),
 ('Fritz', 'Owen', None),
 ('Mary', 'Ahern', 'ahern.m@hij.co'),
 ('Mary', 'Ahern', 'marya@mail.com'),
 ('Mary', 'Ahern', 'msahern@mail.com')]

#### RIGHT OUTER JOIN
* Opposite of LEFT OUTER JOIN
* All rows from the right side will be returned.
* NULL for non-matching left side table.

Obs: unfortunately this is not currently supported by sqlite3

In [24]:
%%sql
SELECT p.person_first_name, p.person_last_name, e.email_address
FROM person p
RIGHT OUTER JOIN email_address e
ON p.person_id = e.email_address_person_id;

 * sqlite://
(sqlite3.OperationalError) RIGHT and FULL OUTER JOINs are not currently supported
[SQL: SELECT p.person_first_name, p.person_last_name, e.email_address
FROM person p
RIGHT OUTER JOIN email_address e
ON p.person_id = e.email_address_person_id;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

#### FULL OUTER JOIN
* LEFT OUTER JOIN + RIGHT OUTER JOIN
* NULL for non-matching left and right sides table.

Obs: unfortunately this is not currently supported by sqlite3

In [25]:
%%sql
SELECT p.person_first_name, p.person_last_name, e.email_address
FROM person p
FULL OUTER JOIN email_address e
ON p.person_id = e.email_address_person_id;

 * sqlite://
(sqlite3.OperationalError) RIGHT and FULL OUTER JOINs are not currently supported
[SQL: SELECT p.person_first_name, p.person_last_name, e.email_address
FROM person p
FULL OUTER JOIN email_address e
ON p.person_id = e.email_address_person_id;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

## INSERT

In [26]:
%%sql
INSERT INTO person
(
    person_id,
    person_first_name,
    person_last_name,
    person_contacted_ntimes, 
    person_address, 
    person_date_added
)
VALUES
(7, 'Jane', 'Howard', 6, 'Newcastle upon Tyne', '2022-06-09 13:47:25'),
(8, 'Matthew', 'Lewis', 2, 'Manchester', '2022-07-09 13:47:25');

 * sqlite://
2 rows affected.

[]

In [27]:
%%sql
SELECT * FROM person

 * sqlite://
Done.

[(1, 'Jon', 'Flanders', 5, 'London', '2022-03-19 13:47:25'),
 (2, 'Shannon', 'Ahern', 0, 'Glasgow', '2022-04-23 13:47:25'),
 (3, 'Fritz', 'Onion', 1, 'York', '2022-04-25 13:47:25'),
 (4, 'Jon', 'Brown', 3, 'Cambridge', '2022-05-11 13:47:25'),
 (5, 'Fritz', 'Owen', 2, 'Edinburgh', '2022-06-01 13:47:25'),
 (6, 'Mary', 'Ahern', 8, None, '2022-06-01 13:47:25'),
 (7, 'Jane', 'Howard', 6, 'Newcastle upon Tyne', '2022-06-09 13:47:25'),
 (8, 'Matthew', 'Lewis', 2, 'Manchester', '2022-07-09 13:47:25')]

## UPDATE

In [28]:
%%sql
UPDATE person
SET person_first_name='Bob', person_last_name='Wilson'
WHERE person_id=1;

 * sqlite://
1 rows affected.

[]

In [29]:
%%sql
SELECT * FROM person

 * sqlite://
Done.

[(1, 'Bob', 'Wilson', 5, 'London', '2022-03-19 13:47:25'),
 (2, 'Shannon', 'Ahern', 0, 'Glasgow', '2022-04-23 13:47:25'),
 (3, 'Fritz', 'Onion', 1, 'York', '2022-04-25 13:47:25'),
 (4, 'Jon', 'Brown', 3, 'Cambridge', '2022-05-11 13:47:25'),
 (5, 'Fritz', 'Owen', 2, 'Edinburgh', '2022-06-01 13:47:25'),
 (6, 'Mary', 'Ahern', 8, None, '2022-06-01 13:47:25'),
 (7, 'Jane', 'Howard', 6, 'Newcastle upon Tyne', '2022-06-09 13:47:25'),
 (8, 'Matthew', 'Lewis', 2, 'Manchester', '2022-07-09 13:47:25')]

## DELETE
* It's permanent.
* WHERE clause is critical.

In [30]:
%%sql
DELETE FROM person
WHERE person_id=8;

 * sqlite://
1 rows affected.

[]

In [31]:
%%sql
SELECT * FROM person

 * sqlite://
Done.

[(1, 'Bob', 'Wilson', 5, 'London', '2022-03-19 13:47:25'),
 (2, 'Shannon', 'Ahern', 0, 'Glasgow', '2022-04-23 13:47:25'),
 (3, 'Fritz', 'Onion', 1, 'York', '2022-04-25 13:47:25'),
 (4, 'Jon', 'Brown', 3, 'Cambridge', '2022-05-11 13:47:25'),
 (5, 'Fritz', 'Owen', 2, 'Edinburgh', '2022-06-01 13:47:25'),
 (6, 'Mary', 'Ahern', 8, None, '2022-06-01 13:47:25'),
 (7, 'Jane', 'Howard', 6, 'Newcastle upon Tyne', '2022-06-09 13:47:25')]